---
kind: property
id: P:Autodesk.Revit.Exceptions.ArgumentException.ParamName
source: html/cf17c2e6-aa4a-3d6a-6fd2-fad6395336df.htm
---
# Autodesk.Revit.Exceptions.ArgumentException.ParamName Property

Gets the name of the parameter that causes this exception.

## Syntax (C#)
```csharp
public string ParamName { get; }
```